---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.IsValid
source: html/672f9ca7-76e3-68e7-5ad8-b44c104a0b8c.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.IsValid Method

Verifies if this is a valid segment id.

## Syntax (C#)
```csharp
public bool IsValid()
```

## Returns
True if this is a valid segment id, otherwise false.